import settings from 'Settings/config.js';
import router from 'Eventum/core/router.js';

function Event(photos, title, place, description) {
    this.photos = photos;
    this.title = title;
    this.place = place;
    this.description = description;
}

const events = [
    new Event(
        [`${settings.aws}/events/3.jpg`, `${settings.aws}/users/4.jpg`],
        'Концерт',
        'Москва',
        'Ну как его похвалить? Ну классный концерт, шикарный концерт, как его ещё похвалить?'),
    new Event(
        [`${settings.aws}/events/2.jpg`, `${settings.aws}/users/1.jpg`],
        'Выставка',
        'Ленинград',
        'Выставка Ван-Гога. Обещают привезти главный экспонат')
];

const staticTags = [
    {name: 'хочувБАР',      tag_id: 1},
    {name: 'хочувКИНО',     tag_id: 2},
    {name: 'хочувТЕАТР',    tag_id: 3},
    {name: 'хочувКЛУБ',     tag_id: 4},
    {name: 'хочунаКОНЦЕРТ', tag_id: 5},
    {name: 'хочуГУЛЯТЬ',    tag_id: 6},
    {name: 'хочунаКАТОК',   tag_id: 7},
    {name: 'хочунаВЫСТАВКУ',tag_id: 8},
    {name: 'хочуСПАТЬ',     tag_id: 9},
    {name: 'хочунаСАЛЮТ',   tag_id: 10},
    {name: 'хочувСПОРТ',    tag_id: 11},
    {name: 'хочувМУЗЕЙ',    tag_id: 12},
    {name: 'хочунаЛЕКЦИЮ',  tag_id: 13},
    {name: 'хочуБОТАТЬ',    tag_id: 14},
    {name: 'хочувПАРК',     tag_id: 15},
];

const MIN_AGE = 18;
const MAX_AGE = 100;
const MIN_LIMIT = 2;
const MAX_LIMIT = 15;

const redirects = new Map([
    [
        'SignIn',
        {
            button_title:   'Зарегистрироваться',
            handler:        (event) => {
                event.preventDefault();
                router.redirectForward('/signup');
            }
        },
    ],
    [
        'Profile',
        {
            button_title:   'Открыть профиль',
            handler:        (event) => {
                event.preventDefault();
                router.redirectForward('/my/profile');
            }
        },
    ],
]);

const icons = new Map([
    [
        'sad',
        '<svg id="error__icon" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="M256 0C114.841 0 0 114.841 0 256s114.841 256 256 256 256-114.841 256-256S397.159 0 256 0zm0 482C131.383 482 30 380.617 30 256S131.383 30 256 30s226 101.383 226 226-101.383 226-226 226z"/><path d="M256 287.245c-41.94 0-81.384 22.35-102.938 58.327-4.258 7.106-1.948 16.319 5.158 20.576 7.107 4.26 16.318 1.948 20.576-5.158 16.166-26.982 45.749-43.745 77.204-43.745 31.544 0 61.17 16.834 77.316 43.933 2.807 4.71 7.788 7.325 12.9 7.325 2.611 0 5.257-.683 7.663-2.116 7.117-4.241 9.448-13.447 5.208-20.564C337.56 309.69 298.059 287.245 256 287.245zM223.272 203.714c2.683-7.837-1.496-16.366-9.333-19.049-7.839-2.683-16.367 1.496-19.05 9.333A35.497 35.497 0 01161.304 218a35.497 35.497 0 01-33.594-24.024c-2.678-7.838-11.202-12.024-19.043-9.346-7.84 2.678-12.023 11.204-9.346 19.043C108.377 230.186 133.286 248 161.304 248c27.998 0 52.901-17.797 61.968-44.286zM403.425 184.665c-7.834-2.681-16.365 1.496-19.05 9.333a35.501 35.501 0 01-67.181-.022c-2.678-7.838-11.2-12.024-19.043-9.346-7.84 2.678-12.023 11.204-9.346 19.043C297.861 230.186 322.771 248 350.789 248c27.997 0 52.9-17.796 61.969-44.284 2.683-7.839-1.495-16.367-9.333-19.051z"/></svg>',
    ],
    [
        'warning',
        '<svg id="error__icon" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="M501.362 383.95L320.497 51.474c-29.059-48.921-99.896-48.986-128.994 0L10.647 383.95c-29.706 49.989 6.259 113.291 64.482 113.291h361.736c58.174 0 94.203-63.251 64.497-113.291zM256 437.241c-16.538 0-30-13.462-30-30s13.462-30 30-30 30 13.462 30 30-13.462 30-30 30zm30-120c0 16.538-13.462 30-30 30s-30-13.462-30-30v-150c0-16.538 13.462-30 30-30s30 13.462 30 30v150z"/></svg>'
    ],
    [
        'finger-left',
        '<svg id="helper__icon" fill="url(#gradient-svg)" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="M496 159.999h-64c-8.832 0-16 7.168-16 16v1.216L269.984 74.719c-10.112-8.192-22.784-11.872-35.52-10.4-12.768 1.472-24.192 7.904-31.84 17.824-8.192 10.048-11.872 22.624-10.368 35.456 1.472 12.8 7.904 24.192 17.952 31.968l13.088 10.432H48c-26.464 0-48 21.536-48 48s21.536 48 48 48h82.944c-1.792 5.024-2.944 10.368-2.944 16 0 17.056 8.992 31.936 22.432 40.48-3.968 6.976-6.432 14.912-6.432 23.52 0 17.056 8.992 31.936 22.432 40.48-3.968 6.976-6.432 14.912-6.432 23.52 0 26.464 21.536 48 48 48h160c18.08 0 34.592-6.24 48-16.384v.384c0 8.832 7.168 16 16 16h64c8.832 0 16-7.168 16-16v-256c0-8.832-7.168-16-16-16zm-80 208c0 26.464-21.536 48-48 48H208c-8.8 0-16-7.2-16-16s7.2-16 16-16h32c8.832 0 16-7.168 16-16s-7.168-16-16-16h-48c-8.8 0-16-7.2-16-16s7.2-16 16-16h32c8.832 0 16-7.168 16-16s-7.168-16-16-16h-48c-8.8 0-16-7.2-16-16s7.2-16 16-16h64c8.832 0 16-7.168 16-16s-7.168-16-16-16H48c-8.8 0-16-7.2-16-16s7.2-16 16-16h221.12c.288 0 .544-.16.8-.16 1.184-.064 2.272-.384 3.424-.704.928-.256 1.824-.416 2.624-.8.928-.448 1.696-1.088 2.528-1.696.896-.672 1.728-1.28 2.464-2.08.224-.224.512-.352.704-.608.448-.576.608-1.28.96-1.888.544-.928 1.088-1.792 1.44-2.848.384-1.056.544-2.144.672-3.264.096-.672.384-1.248.384-1.952 0-.288-.16-.544-.16-.864-.064-1.12-.384-2.208-.672-3.296-.256-.928-.448-1.856-.864-2.72-.416-.896-1.056-1.664-1.664-2.464-.64-.896-1.248-1.76-2.08-2.496-.224-.192-.352-.48-.576-.704l-49.152-39.072c-3.36-2.592-5.44-6.304-5.92-10.432-.512-4.192.704-8.288 3.648-11.936 2.592-3.328 6.304-5.472 10.432-5.952 4.416-.384 8.352.8 12.544 4.16l158.528 111.328c4.288 2.976 6.816 7.84 6.816 13.088v143.36zm64 48h-32v-224h32v224z"/></svg>'
    ],
]);

const images = new Map([
    [
        'user-default',
        'https://eventum.s3.eu-north-1.amazonaws.com/users/default.png',
    ],
]);

export {Event, events, staticTags, MIN_AGE, MAX_AGE, MIN_LIMIT, MAX_LIMIT, redirects, icons, images};
